[
{
"id": 13,
"title": "Spending Restrictions, Technique TFA-T-6003",
"path": "/techniques/TFA-T-6003/index.html",
"content": " Spending Restrictions Using account controls, card limits, transaction blocks, or approval requirements to restrict what victim can spend money on, how much, and where. May exploit joint account features, parental controls on youth accounts applied to adults, or business account administrative features. ID: TFA-T-6003 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 14,
"title": "Unauthorized Transactions, Technique TFA-T-6004",
"path": "/techniques/TFA-T-6004/index.html",
"content": " Unauthorized Transactions Making purchases, transfers, or withdrawals from victim's financial accounts without consent. May drain savings, make extravagant purchases, transfer funds to perpetrator-controlled accounts, or take on debt in victim's name. Often escalates during separation when perpetrator seeks to deplete shared resources. ID: TFA-T-6004 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 15,
"title": "Account Takeover, Technique TFA-T-2002",
"path": "/techniques/TFA-T-2002/index.html",
"content": " Account Takeover Gaining full control of victim's accounts including email, social media, banking, government services, or utilities by changing credentials and recovery options. Complete takeover denies victim access while giving perpetrator full control over the account, including stored data, communications, and financial functions. ID: TFA-T-2002 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 16,
"title": "Device Lockout, Technique TFA-T-2005",
"path": "/techniques/TFA-T-2005/index.html",
"content": " Device Lockout Remotely locking victim's phone, tablet, or computer through device management features such as Find My iPhone, Google Find My Device, or enterprise MDM tools. Can render devices completely unusable, cutting victim off from communication, navigation, banking, and emergency services. ID: TFA-T-2005 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 17,
"title": "Session Hijacking, Technique TFA-T-2004",
"path": "/techniques/TFA-T-2004/index.html",
"content": " Session Hijacking Maintaining persistent access to victim's logged-in sessions by keeping devices logged in, copying session tokens, or exploiting 'remember this device' features. Allows perpetrator to monitor accounts without triggering new login alerts, making detection more difficult. ID: TFA-T-2004 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 18,
"title": "Password/Recovery Change, Technique TFA-T-2003",
"path": "/techniques/TFA-T-2003/index.html",
"content": " Password/Recovery Change Changing passwords and recovery options (backup email, phone number, security questions) on victim's accounts to lock them out and prevent recovery. This technique ensures persistent denial of access even if victim attempts account recovery procedures. ID: TFA-T-2003 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 19,
"title": "Coerced Transactions, Technique TFA-T-6005",
"path": "/techniques/TFA-T-6005/index.html",
"content": " Coerced Transactions Using threats, intimidation, or manipulation to force victim to transfer money, sign financial documents, take on debt, or make purchases. Digital coercion may include threatening messages, threatening to share intimate images, threatening custody action, or other leverage to compel financial compliance. ID: TFA-T-6005 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 20,
"title": "Transaction Monitoring, Technique TFA-T-6002",
"path": "/techniques/TFA-T-6002/index.html",
"content": " Transaction Monitoring Tracking all of victim's financial transactions through shared bank account access, transaction alert notifications, statement monitoring, or financial app access. Creates comprehensive surveillance of victim's spending, location (from merchant addresses), social activities, and any attempts to prepare for leaving. ID: TFA-T-6002 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 21,
"title": "Coordinated Harassment Campaign, Technique TFA-T-3004",
"path": "/techniques/TFA-T-3004/index.html",
"content": " Coordinated Harassment Campaign Organizing or inciting multiple people to simultaneously harass victim through pile-ons, brigading, coordinated reporting, mass messaging, or targeted online mob behavior. Perpetrator may directly recruit participants or create conditions that provoke organic harassment from communities. ID: TFA-T-3004 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 22,
"title": "Contact After Blocking, Technique TFA-T-3003",
"path": "/techniques/TFA-T-3003/index.html",
"content": " Contact After Blocking Creating new accounts, using alternative platforms, borrowing others' devices, or finding other channels to continue contacting victim after being blocked. Demonstrates persistent intent to circumvent victim's boundaries and platform safety features. ID: TFA-T-3003 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 23,
"title": "Vehicle Sabotage, Technique TFA-T-7005",
"path": "/techniques/TFA-T-7005/index.html",
"content": " Vehicle Sabotage Remotely disabling, manipulating, or monitoring victim's connected vehicle. Modern connected cars may be remotely controlled through manufacturer apps, including locking/unlocking, starting/stopping engine, tracking location, and in some cases controlling speed or braking. May also include disabling vehicle through telematics systems. ID: TFA-T-7005 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 24,
"title": "Safe Location Disclosure, Technique TFA-T-7002",
"path": "/techniques/TFA-T-7002/index.html",
"content": " Safe Location Disclosure Revealing the location of victim's shelter, safe house, refuge, or hidden address to the perpetrator or others. May involve sharing information publicly, telling mutual contacts, or using technology to discover and disclose the protected location, directly endangering victim's physical safety. ID: TFA-T-7002 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 25,
"title": "Movement Interception, Technique TFA-T-7003",
"path": "/techniques/TFA-T-7003/index.html",
"content": " Movement Interception Using location tracking data to intercept victim during travel, at appointments, or at known destinations. Perpetrator uses real-time or predicted location information to position themselves along victim's route or at their destination. Creates a sense of inescapable surveillance and control. ID: TFA-T-7003 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 26,
"title": "Smart Lock Manipulation, Technique TFA-T-7004",
"path": "/techniques/TFA-T-7004/index.html",
"content": " Smart Lock Manipulation Remotely locking victim inside or outside of their residence, changing access codes, or manipulating smart lock systems to control victim's physical movement and access to shelter. May also include granting access to others or monitoring entry/exit patterns. ID: TFA-T-7004 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 27,
"title": "Persistent Unwanted Contact, Technique TFA-T-3002",
"path": "/techniques/TFA-T-3002/index.html",
"content": " Persistent Unwanted Contact Repeatedly contacting victim despite clear requests to stop, across one or multiple communication platforms. Volume and persistence are used to exhaust, intimidate, and demonstrate that the victim cannot escape the perpetrator's reach. May include hundreds of messages, calls, or contact attempts per day. ID: TFA-T-3002 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 28,
"title": "Doxxing, Technique TFA-T-3005",
"path": "/techniques/TFA-T-3005/index.html",
"content": " Doxxing Publishing victim's private information (home address, phone number, workplace, family members, daily routines) publicly or to targeted audiences with intent to enable harassment, stalking, or physical harm. Doxxing weaponizes personal information by removing the victim's control over who has access to it, often resulting in coordinated harassment, threats, and real-world danger. ID: TFA-T-3005 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 29,
"title": "Catfishing/Romance Fraud, Technique TFA-T-4008",
"path": "/techniques/TFA-T-4008/index.html",
"content": " Catfishing/Romance Fraud Creating a false online identity to build a fraudulent romantic relationship with victim for purposes of financial exploitation, emotional manipulation, intelligence gathering, or other harm. May involve elaborate fake personas maintained over months or years, including stolen photos, fabricated life stories, and manufactured emotional bonds. ID: TFA-T-4008 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 30,
"title": "Child Custody Tech Abuse, Technique TFA-T-7010",
"path": "/techniques/TFA-T-7010/index.html",
"content": " Child Custody Tech Abuse Using location sharing requirements, court-ordered communication apps, parenting coordination platforms, or children's devices to extend surveillance, control, and abuse beyond separation. Exploits legitimate co-parenting technology to maintain perpetrator's access to and control over victim's life through the children. ID: TFA-T-7010 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 31,
"title": "Message/Evidence Tampering, Technique TFA-T-4001",
"path": "/techniques/TFA-T-4001/index.html",
"content": " Message/Evidence Tampering Editing, deleting, selectively screenshotting, or fabricating screenshots of conversations, messages, or digital records to misrepresent what was communicated. Used to create false evidence, destroy exculpatory evidence, or support false narratives in legal proceedings and social contexts. ID: TFA-T-4001 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 32,
"title": "Contact Bombing, Technique TFA-T-3011",
"path": "/techniques/TFA-T-3011/index.html",
"content": " Contact Bombing Signing victim up for large volumes of spam, unwanted subscriptions, mailing lists, or services to overwhelm their communications and cause distress. May also include signing victim up for politically sensitive, embarrassing, or compromising services. ID: TFA-T-3011 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 33,
"title": "Context Manipulation, Technique TFA-T-4006",
"path": "/techniques/TFA-T-4006/index.html",
"content": " Context Manipulation Sharing genuine content — real messages, photos, videos, or statements — stripped of essential context to create a misleading impression of victim's character, actions, or intentions. Includes selective quoting, cropping images, sharing old content as if current, or presenting content without the circumstances that explain it. ID: TFA-T-4006 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 34,
"title": "Sextortion, Technique TFA-T-4007",
"path": "/techniques/TFA-T-4007/index.html",
"content": " Sextortion Threatening to release intimate content (real or fabricated) unless victim complies with demands for money, further intimate content, sexual acts, or other concessions. Combines elements of sexual exploitation, financial fraud, and psychological coercion, creating a cycle of escalating demands. ID: TFA-T-4007 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 35,
"title": "Review/Rating Attacks, Technique TFA-T-3010",
"path": "/techniques/TFA-T-3010/index.html",
"content": " Review/Rating Attacks Posting false negative reviews of victim's business, professional profiles, or services across review platforms. Damages victim's professional reputation, income, and career prospects. May coordinate multiple fake reviews to appear credible. ID: TFA-T-3010 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 36,
"title": "Reputation Destruction SEO, Technique TFA-T-4009",
"path": "/techniques/TFA-T-4009/index.html",
"content": " Reputation Destruction SEO Creating websites, blog posts, social media content, or other material specifically designed to rank highly in search results for victim's name, damaging their reputation to anyone who searches for them. Content may include false accusations, embarrassing information, intimate images, or misleading narratives. ID: TFA-T-4009 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 37,
"title": "Calendar/Schedule Surveillance, Technique TFA-T-1008",
"path": "/techniques/TFA-T-1008/index.html",
"content": " Calendar/Schedule Surveillance Accessing victim's calendar applications, booking systems, medical appointment portals, or work schedules to track movements and anticipate whereabouts. May exploit shared family calendars, compromised account access, or work systems to build a detailed picture of victim's routine. ID: TFA-T-1008 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 38,
"title": "Administrative Access Abuse, Technique TFA-T-2010",
"path": "/techniques/TFA-T-2010/index.html",
"content": " Administrative Access Abuse Using parental controls, family administrator privileges, or enterprise MDM capabilities to exert control over an adult victim's devices and accounts. Exploits legitimate administrative tools designed for child safety or corporate security to restrict an adult's digital autonomy. ID: TFA-T-2010 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 39,
"title": "Communication Monitoring Disclosure, Technique TFA-T-5007",
"path": "/techniques/TFA-T-5007/index.html",
"content": " Communication Monitoring Disclosure Deliberately telling victim that all their communications are being monitored to create a chilling effect of self-censorship. Victim becomes afraid to reach out for help, discuss the abuse, or communicate honestly, effectively isolating themselves out of fear. May be truthful or bluffed. ID: TFA-T-5007 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 40,
"title": "Identity Document Control, Technique TFA-T-5009",
"path": "/techniques/TFA-T-5009/index.html",
"content": " Identity Document Control Controlling access to digital copies of victim's important identification documents including passport scans, birth certificates, tax records, medical records, immigration documents, or legal paperwork. Restricts victim's ability to access services, prove identity, or leave the relationship. ID: TFA-T-5009 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 41,
"title": "Subscription/Service Cancellation, Technique TFA-T-6011",
"path": "/techniques/TFA-T-6011/index.html",
"content": " Subscription/Service Cancellation Cancelling victim's essential services including phone plans, internet service, insurance, utility accounts, or subscriptions without consent. Disrupts victim's daily life, communication ability, and access to essential services. May be timed to cause maximum impact such as during extreme weather or when victim is isolated. ID: TFA-T-6011 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 42,
"title": "Smart Home Surveillance, Technique TFA-T-1006",
"path": "/techniques/TFA-T-1006/index.html",
"content": " Smart Home Surveillance Using shared smart home devices including cameras, video doorbells, baby monitors, voice assistants, and other IoT devices to monitor victim's presence, activities, conversations, and visitors. Often exploits devices installed during cohabitation where perpetrator retains administrative access after separation. ID: TFA-T-1006 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 43,
"title": "Stalkerware Installation, Technique TFA-T-1001",
"path": "/techniques/TFA-T-1001/index.html",
"content": " Stalkerware Installation Installing hidden monitoring software on victim's device to track location, messages, calls, photos, and keystrokes. Stalkerware (also called spouseware or creepware) is commercially available software marketed for 'parental monitoring' or 'employee tracking' but frequently used for intimate partner surveillance. These apps typically hide their presence, run silently in the background, and transmit data to the perpetrator. ID: TFA-T-1001 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 44,
"title": "Support Resource Blocking, Technique TFA-T-5008",
"path": "/techniques/TFA-T-5008/index.html",
"content": " Support Resource Blocking Blocking victim's access to helplines, support websites, crisis services, legal aid resources, or domestic violence organizations. May involve website blocking through router controls, removing helpline numbers from victim's phone, or intercepting communications with support services. ID: TFA-T-5008 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 45,
"title": "Network Traffic Monitoring, Technique TFA-T-1007",
"path": "/techniques/TFA-T-1007/index.html",
"content": " Network Traffic Monitoring Monitoring victim's internet activity through router administrative access, DNS logs, or network monitoring tools. Perpetrator can see websites visited, search queries, app usage patterns, and connected devices. May install network-level monitoring tools or exploit existing router features. ID: TFA-T-1007 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 46,
"title": "Employment Sabotage, Technique TFA-T-6010",
"path": "/techniques/TFA-T-6010/index.html",
"content": " Employment Sabotage Interfering with victim's employment through manipulation of work communications, sending messages to employers, sabotaging job applications, damaging professional online presence, or disrupting work-related accounts. Aims to undermine victim's economic independence and professional reputation. ID: TFA-T-6010 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 47,
"title": "Communication Interception & Response, Technique TFA-T-5001",
"path": "/techniques/TFA-T-5001/index.html",
"content": " Communication Interception & Response Reading and responding to victim's messages while impersonating the victim, without their knowledge. Perpetrator intercepts communications from victim's friends, family, support services, or legal representatives and responds as the victim, undermining support networks and controlling information flow. ID: TFA-T-5001 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 48,
"title": "Third-Party Monitoring Recruitment, Technique TFA-T-1009",
"path": "/techniques/TFA-T-1009/index.html",
"content": " Third-Party Monitoring Recruitment Enlisting friends, family members, mutual contacts, or acquaintances (sometimes called 'flying monkeys') to monitor and report on victim's activities, location, companions, and emotional state. May involve deliberately maintaining relationships with victim's contacts for intelligence gathering purposes. ID: TFA-T-1009 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 49,
"title": "Platform Banning Coordination, Technique TFA-T-5006",
"path": "/techniques/TFA-T-5006/index.html",
"content": " Platform Banning Coordination Orchestrating victim's removal or banning from online platforms, groups, or communities where they have established support networks. Uses coordinated mass reporting, false claims of terms of service violations, or manipulation of community moderators to silence and isolate victim. ID: TFA-T-5006 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 50,
"title": "Fitness/Health Tracker Surveillance, Technique TFA-T-1010",
"path": "/techniques/TFA-T-1010/index.html",
"content": " Fitness/Health Tracker Surveillance Monitoring victim through health and fitness applications, wearable trackers, period tracking apps, sleep monitors, or medical portals. These platforms often contain highly sensitive data about location, physical activity, health conditions, reproductive status, and daily routines. ID: TFA-T-1010 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 51,
"title": "Benefits/Payments Interception, Technique TFA-T-6007",
"path": "/techniques/TFA-T-6007/index.html",
"content": " Benefits/Payments Interception Redirecting victim's income, government benefits, tax refunds, insurance payments, or other financial entitlements to perpetrator-controlled accounts. May involve changing direct deposit information, intercepting physical mail, controlling online government portals, or filing fraudulent claims. ID: TFA-T-6007 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 52,
"title": "Shared Account Weaponization, Technique TFA-T-2008",
"path": "/techniques/TFA-T-2008/index.html",
"content": " Shared Account Weaponization Using legitimately shared accounts for streaming services, utilities, subscriptions, or household management to exert control or punish victim. Includes changing shared passwords, cancelling shared services, monitoring usage patterns, or using account features to track victim's activity and preferences. ID: TFA-T-2008 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 53,
"title": "Two-Factor Interception, Technique TFA-T-2006",
"path": "/techniques/TFA-T-2006/index.html",
"content": " Two-Factor Interception Intercepting two-factor authentication codes through SIM swapping, access to victim's authenticator app, interception of SMS codes, or control of backup codes. Defeats security measures designed to protect accounts, enabling unauthorized access even when victim has changed passwords. ID: TFA-T-2006 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 54,
"title": "Smart Home Resource Control, Technique TFA-T-6009",
"path": "/techniques/TFA-T-6009/index.html",
"content": " Smart Home Resource Control Controlling heating, cooling, electricity, water, locks, lighting, or other utilities through smart home systems to coerce, punish, or make the home environment hostile. Perpetrator with administrative access can remotely control living conditions, creating physical discomfort or danger. ID: TFA-T-6009 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 55,
"title": "Credential Theft, Technique TFA-T-2001",
"path": "/techniques/TFA-T-2001/index.html",
"content": " Credential Theft Obtaining victim's passwords, PINs, or authentication credentials through shoulder surfing, guessing based on personal knowledge, social engineering, checking common password patterns, or accessing written password records. Intimate partners often have enough personal knowledge to guess passwords or know where credentials are stored. ID: TFA-T-2001 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 56,
"title": "Techniques - TFA",
"path": "/techniques/tfa/index.html",
"content": " TFA Techniques Techniques represent 'how' an adversary achieves a tactical goal by performing an action. For example, an adversary may install stalkerware to achieve surveillance and tracking. Techniques: 74 Sub-techniques: 0 ID Name Description TFA-T-2002 Account Takeover Gaining full control of victim's accounts including email, social media, banking, government services, or utilities by changing credentials and recovery options. Complete takeover denies victim access while giving perpetrator full control over the account, including stored data, communications, and financial functions. TFA-T-2010 Administrative Access Abuse Using parental controls, family administrator privileges, or enterprise MDM capabilities to exert control over an adult victim's devices and accounts. Exploits legitimate administrative tools designed for child safety or corporate security to restrict an adult's digital autonomy. TFA-T-2007 Backup/Cloud Access Accessing victim's personal data through cloud backup services such as iCloud, Google Drive, OneDrive, or device backups. Cloud backups often contain comprehensive copies of messages, photos, contacts, browsing history, and app data, providing extensive surveillance capability from a single access point. TFA-T-6007 Benefits/Payments Interception Redirecting victim's income, government benefits, tax refunds, insurance payments, or other financial entitlements to perpetrator-controlled accounts. May involve changing direct deposit information, intercepting physical mail, controlling online government portals, or filing fraudulent claims. TFA-T-1008 Calendar/Schedule Surveillance Accessing victim's calendar applications, booking systems, medical appointment portals, or work schedules to track movements and anticipate whereabouts. May exploit shared family calendars, compromised account access, or work systems to build a detailed picture of victim's routine. TFA-T-4008 Catfishing/Romance Fraud Creating a false online identity to build a fraudulent romantic relationship with victim for purposes of financial exploitation, emotional manipulation, intelligence gathering, or other harm. May involve elaborate fake personas maintained over months or years, including stolen photos, fabricated life stories, and manufactured emotional bonds. TFA-T-7010 Child Custody Tech Abuse Using location sharing requirements, court-ordered communication apps, parenting coordination platforms, or children's devices to extend surveillance, control, and abuse beyond separation. Exploits legitimate co-parenting technology to maintain perpetrator's access to and control over victim's life through the children. TFA-T-6005 Coerced Transactions Using threats, intimidation, or manipulation to force victim to transfer money, sign financial documents, take on debt, or make purchases. Digital coercion may include threatening messages, threatening to share intimate images, threatening custody action, or other leverage to compel financial compliance. TFA-T-1005 Communication Interception Accessing victim's emails, text messages, voicemails, and other communications through compromised accounts, email forwarding rules, message mirroring, or linked devices. Perpetrator reads, copies, or monitors communications without victim's knowledge, gaining intelligence about victim's plans, support network, and emotional state. TFA-T-5001 Communication Interception & Response Reading and responding to victim's messages while impersonating the victim, without their knowledge. Perpetrator intercepts communications from victim's friends, family, support services, or legal representatives and responds as the victim, undermining support networks and controlling information flow. TFA-T-5007 Communication Monitoring Disclosure Deliberately telling victim that all their communications are being monitored to create a chilling effect of self-censorship. Victim becomes afraid to reach out for help, discuss the abuse, or communicate honestly, effectively isolating themselves out of fear. May be truthful or bluffed. TFA-T-3003 Contact After Blocking Creating new accounts, using alternative platforms, borrowing others' devices, or finding other channels to continue contacting victim after being blocked. Demonstrates persistent intent to circumvent victim's boundaries and platform safety features. TFA-T-5002 Contact Blocking/Filtering Blocking victim's contacts or filtering their incoming communications without victim's knowledge or consent. Perpetrator may block specific people on victim's phone, set up email filters to auto-delete messages from support contacts, or manipulate device settings to prevent certain calls or messages from reaching victim. TFA-T-3011 Contact Bombing Signing victim up for large volumes of spam, unwanted subscriptions, mailing lists, or services to overwhelm their communications and cause distress. May also include signing victim up for politically sensitive, embarrassing, or compromising services. TFA-T-4006 Context Manipulation Sharing genuine content — real messages, photos, videos, or statements — stripped of essential context to create a misleading impression of victim's character, actions, or intentions. Includes selective quoting, cropping images, sharing old content as if current, or presenting content without the circumstances that explain it. TFA-T-3004 Coordinated Harassment Campaign Organizing or inciting multiple people to simultaneously harass victim through pile-ons, brigading, coordinated reporting, mass messaging, or targeted online mob behavior. Perpetrator may directly recruit participants or create conditions that provoke organic harassment from communities. TFA-T-2001 Credential Theft Obtaining victim's passwords, PINs, or authentication credentials through shoulder surfing, guessing based on personal knowledge, social engineering, checking common password patterns, or accessing written password records. Intimate partners often have enough personal knowledge to guess passwords or know where credentials are stored. TFA-T-6008 Credit/Identity Theft Opening financial accounts, taking on debt, applying for credit, or conducting financial transactions using victim's personal information and identity without consent. Damages victim's credit score, creates legal liability, and may take years to resolve. Often not discovered until victim is denied credit or contacted by collectors. TFA-T-6006 Crypto/Investment Fraud Deceiving victim into fraudulent cryptocurrency investments, fake trading platforms, or other financial schemes. Often involves building trust, demonstrating fake returns, and gradually escalating investment amounts. May also involve coerced cryptocurrency transfers that are difficult to trace or recover. TFA-T-4004 Deepfake Creation Creating synthetic intimate, compromising, or damaging media of victim using AI-powered deepfake technology. Generated content may be indistinguishable from real imagery and can be used for extortion, reputational harm, or psychological abuse. Includes face-swapping onto pornographic content, synthetic voice generation, or fabricated video. TFA-T-2005 Device Lockout Remotely locking victim's phone, tablet, or computer through device management features such as Find My iPhone, Google Find My Device, or enterprise MDM tools. Can render devices completely unusable, cutting victim off from communication, navigation, banking, and emergency services. TFA-T-2009 Device Sabotage Deliberately damaging, corrupting, factory-resetting, or wiping victim's devices or data. May involve physical damage, remote wipe commands, malware installation, or deliberate corruption of important files. Destroys evidence, disrupts victim's ability to communicate, and causes emotional and financial harm. TFA-T-5004 Device Time/Access Restrictions Using parental controls, screen time management, MDM features, or physical control to restrict when and how victim can use their own devices. Limits victim's ability to communicate, access information, seek help, or maintain independence. TFA-T-4002 Digital Gaslighting Manipulating digital records, device settings, files, or other digital artifacts to make victim doubt their own memory, perception, or sanity. Includes moving or deleting files, editing shared documents, changing device settings, manipulating photo timestamps, or altering digital records the victim relies on. TFA-T-3001 Direct Threat Messaging Sending threatening messages to victim via any digital platform, including text messages, emails, direct messages, voice messages, or comments. Threats may be explicit (threatening violence, harm, or consequences) or implicit (veiled references to harm, ominous statements, or threatening imagery). TFA-T-3005 Doxxing Publishing victim's private information (home address, phone number, workplace, family members, daily routines) publicly or to targeted audiences with intent to enable harassment, stalking, or physical harm. Doxxing weaponizes personal information by removing the victim's control over who has access to it, often resulting in coordinated harassment, threats, and real-world danger. TFA-T-5010 Email/Communication Rerouting Setting up email forwarding rules, message redirects, or call forwarding to intercept victim's incoming communications without their knowledge. Allows perpetrator to monitor all communications and selectively prevent messages from reaching victim, particularly from support services or legal representatives. TFA-T-7009 Emergency Service Manipulation Filing false police reports, fabricating evidence for protective orders, making false welfare check requests, or otherwise weaponizing emergency and legal services against victim. Uses digital tools to create false evidence, coordinate false reports, or manipulate authorities into taking action against victim. TFA-T-6010 Employment Sabotage Interfering with victim's employment through manipulation of work communications, sending messages to employers, sabotaging job applications, damaging professional online presence, or disrupting work-related accounts. Aims to undermine victim's economic independence and professional reputation. TFA-T-4011 Fake Evidence Creation Fabricating digital evidence including fake emails, text messages, documents, receipts, screenshots, or records to frame victim for misconduct, support false legal claims, or manipulate decision-makers. May involve sophisticated forgeries using editing tools or simple fabrication of documents. TFA-T-4005 False Narrative Campaigns Systematically spreading false information about victim to their social network, workplace, community, or online audiences. False narratives may portray victim as unstable, abusive, dishonest, or dangerous, serving to isolate victim from support, preemptively discredit their accounts of abuse, and build sympathy for perpetrator. TFA-T-6001 Financial Account Lockout Changing passwords, removing authorized users, or otherwise denying victim access to shared or individual financial accounts. Cuts victim off from their own money, savings, investments, or financial records, creating immediate economic vulnerability and dependence. TFA-T-1010 Fitness/Health Tracker Surveillance Monitoring victim through health and fitness applications, wearable trackers, period tracking apps, sleep monitors, or medical portals. These platforms often contain highly sensitive data about location, physical activity, health conditions, reproductive status, and daily routines. TFA-T-4010 Historical Content Weaponization Surfacing old posts, photos, messages, or other historical digital content to harm victim in their current context. Includes finding embarrassing teenage posts, old dating profiles, past political statements, or previously private content that can be taken out of context to damage victim's current relationships, employment, or reputation. TFA-T-5009 Identity Document Control Controlling access to digital copies of victim's important identification documents including passport scans, birth certificates, tax records, medical records, immigration documents, or legal paperwork. Restricts victim's ability to access services, prove identity, or leave the relationship. TFA-T-3009 Impersonation Harassment Creating fake accounts impersonating victim to damage their reputation, relationships, or employment. Fake accounts may send messages to victim's contacts, post inappropriate content, engage in harmful activities, or create the appearance that victim is behaving erratically or antisocially. TFA-T-7006 IoT Device Weaponization Using smart home devices to create fear, disorientation, or physical discomfort. Includes randomly triggering alarms, playing sounds through speakers, turning lights on/off, changing temperature extremes, activating cameras, or other manipulations of the smart home environment designed to terrorize victim. TFA-T-7001 Location-Based Assault Using GPS tracking, location sharing, or other surveillance techniques to determine victim's real-time location and then physically approaching or assaulting them. Technology enables perpetrator to find victim at any location, negating traditional safety measures like staying with friends or varying routines. TFA-T-7007 Medical Device Interference Tampering with victim's connected medical devices, health monitoring equipment, or health data. May include altering medication reminder settings, manipulating health data to affect treatment decisions, disabling monitoring devices, or interfering with telehealth appointments. Creates direct physical health risks. TFA-T-4001 Message/Evidence Tampering Editing, deleting, selectively screenshotting, or fabricating screenshots of conversations, messages, or digital records to misrepresent what was communicated. Used to create false evidence, destroy exculpatory evidence, or support false narratives in legal proceedings and social contexts. TFA-T-7003 Movement Interception Using location tracking data to intercept victim during travel, at appointments, or at known destinations. Perpetrator uses real-time or predicted location information to position themselves along victim's route or at their destination. Creates a sense of inescapable surveillance and control. TFA-T-5005 Network Poisoning Contacting victim's support network (friends, family, colleagues, therapist, legal counsel) to spread lies, create conflict, or undermine trust. Perpetrator strategically reaches out to key support people to isolate victim from help sources, often preemptively positioning themselves as the reasonable party. TFA-T-1007 Network Traffic Monitoring Monitoring victim's internet activity through router administrative access, DNS logs, or network monitoring tools. Perpetrator can see websites visited, search queries, app usage patterns, and connected devices. May install network-level monitoring tools or exploit existing router features. TFA-T-4003 Non-Consensual Intimate Image Distribution Sharing or threatening to share intimate, sexual, or nude images of victim without their consent. Commonly known as 'revenge porn,' this technique weaponizes intimate content to humiliate, control, or coerce victim. Includes sharing via private messages, posting publicly, uploading to pornographic websites, or sending to victim's contacts, family, or employer. TFA-T-2003 Password/Recovery Change Changing passwords and recovery options (backup email, phone number, security questions) on victim's accounts to lock them out and prevent recovery. This technique ensures persistent denial of access even if victim attempts account recovery procedures. TFA-T-3002 Persistent Unwanted Contact Repeatedly contacting victim despite clear requests to stop, across one or multiple communication platforms. Volume and persistence are used to exhaust, intimidate, and demonstrate that the victim cannot escape the perpetrator's reach. May include hundreds of messages, calls, or contact attempts per day. TFA-T-1002 Physical Tracker Planting Placing GPS tracking devices such as AirTags, Tile trackers, or vehicle GPS units in victim's belongings, vehicle, or on their person without consent. These commercially available devices are inexpensive, small, and designed for long battery life, making covert placement easy. Perpetrators use them to monitor victim's movements, identify frequented locations, and anticipate travel patterns. TFA-T-3007 Platform Abuse Reporting Weaponizing platform content moderation and reporting systems to get victim's accounts banned, restricted, or content removed. Perpetrator files false or exaggerated reports about victim's content, coordinating multiple reports to trigger automated enforcement. Silences victim and removes their online presence. TFA-T-5006 Platform Banning Coordination Orchestrating victim's removal or banning from online platforms, groups, or communities where they have established support networks. Uses coordinated mass reporting, false claims of terms of service violations, or manipulation of community moderators to silence and isolate victim. TFA-T-3012 Proxy Harassment via AI Using AI tools including large language models, voice cloning, or text generation to create and distribute harassing content at scale. AI enables perpetrators to generate personalized, varied harassment content more quickly and in greater volume than manual methods, and may disguise the perpetrator's authorship. TFA-T-3008 Public Humiliation Posts Posting embarrassing, mocking, degrading, or humiliating content about victim on public platforms. Content may include unflattering images, private information, personal struggles, or fabricated scenarios designed to damage victim's social standing and cause emotional harm. TFA-T-4009 Reputation Destruction SEO Creating websites, blog posts, social media content, or other material specifically designed to rank highly in search results for victim's name, damaging their reputation to anyone who searches for them. Content may include false accusations, embarrassing information, intimate images, or misleading narratives. TFA-T-3010 Review/Rating Attacks Posting false negative reviews of victim's business, professional profiles, or services across review platforms. Damages victim's professional reputation, income, and career prospects. May coordinate multiple fake reviews to appear credible. TFA-T-7002 Safe Location Disclosure Revealing the location of victim's shelter, safe house, refuge, or hidden address to the perpetrator or others. May involve sharing information publicly, telling mutual contacts, or using technology to discover and disclose the protected location, directly endangering victim's physical safety. TFA-T-2004 Session Hijacking Maintaining persistent access to victim's logged-in sessions by keeping devices logged in, copying session tokens, or exploiting 'remember this device' features. Allows perpetrator to monitor accounts without triggering new login alerts, making detection more difficult. TFA-T-4007 Sextortion Threatening to release intimate content (real or fabricated) unless victim complies with demands for money, further intimate content, sexual acts, or other concessions. Combines elements of sexual exploitation, financial fraud, and psychological coercion, creating a cycle of escalating demands. TFA-T-1003 Shared Account Surveillance Exploiting legitimately shared accounts or location sharing services (Find My Friends, Google location sharing, family phone plans) to monitor victim beyond the scope of original consent. Often occurs in relationships where sharing was mutual but continues after separation, or where the perpetrator coerces ongoing access under the guise of reasonable family coordination. TFA-T-2008 Shared Account Weaponization Using legitimately shared accounts for streaming services, utilities, subscriptions, or household management to exert control or punish victim. Includes changing shared passwords, cancelling shared services, monitoring usage patterns, or using account features to track victim's activity and preferences. TFA-T-6009 Smart Home Resource Control Controlling heating, cooling, electricity, water, locks, lighting, or other utilities through smart home systems to coerce, punish, or make the home environment hostile. Perpetrator with administrative access can remotely control living conditions, creating physical discomfort or danger. TFA-T-1006 Smart Home Surveillance Using shared smart home devices including cameras, video doorbells, baby monitors, voice assistants, and other IoT devices to monitor victim's presence, activities, conversations, and visitors. Often exploits devices installed during cohabitation where perpetrator retains administrative access after separation. TFA-T-7004 Smart Lock Manipulation Remotely locking victim inside or outside of their residence, changing access codes, or manipulating smart lock systems to control victim's physical movement and access to shelter. May also include granting access to others or monitoring entry/exit patterns. TFA-T-5003 Social Media Control Controlling who victim can follow, friend, interact with, or be visible to on social media platforms. May involve demanding victim unfriend specific contacts, monitoring follower/following lists, requiring approval before posting, or demanding social media passwords to vet all interactions. TFA-T-1004 Social Media Monitoring Systematic observation of victim's public and semi-public social media activity, connections, check-ins, likes, comments, and tagged posts. May include creating fake accounts to follow private profiles, monitoring friends' posts for references to victim, or using social media analytics tools to track patterns of activity and connections. TFA-T-6003 Spending Restrictions Using account controls, card limits, transaction blocks, or approval requirements to restrict what victim can spend money on, how much, and where. May exploit joint account features, parental controls on youth accounts applied to adults, or business account administrative features. TFA-T-1001 Stalkerware Installation Installing hidden monitoring software on victim's device to track location, messages, calls, photos, and keystrokes. Stalkerware (also called spouseware or creepware) is commercially available software marketed for 'parental monitoring' or 'employee tracking' but frequently used for intimate partner surveillance. These apps typically hide their presence, run silently in the background, and transmit data to the perpetrator. TFA-T-7008 Stalking Coordination Using technology to plan, coordinate, and execute physical stalking of victim. Includes using location data to track patterns, mapping victim's routine, coordinating with others to maintain surveillance, and using digital tools to avoid detection. Technology amplifies traditional stalking by providing real-time intelligence. TFA-T-6011 Subscription/Service Cancellation Cancelling victim's essential services including phone plans, internet service, insurance, utility accounts, or subscriptions without consent. Disrupts victim's daily life, communication ability, and access to essential services. May be timed to cause maximum impact such as during extreme weather or when victim is isolated. TFA-T-5008 Support Resource Blocking Blocking victim's access to helplines, support websites, crisis services, legal aid resources, or domestic violence organizations. May involve website blocking through router controls, removing helpline numbers from victim's phone, or intercepting communications with support services. TFA-T-3006 Swatting Making false emergency reports (bomb threats, hostage situations, active shooter calls) to provoke armed law enforcement response at victim's location. Swatting creates immediate physical danger to victim and household, causes severe psychological trauma, and may result in injury or death from police response. TFA-T-1009 Third-Party Monitoring Recruitment Enlisting friends, family members, mutual contacts, or acquaintances (sometimes called 'flying monkeys') to monitor and report on victim's activities, location, companions, and emotional state. May involve deliberately maintaining relationships with victim's contacts for intelligence gathering purposes. TFA-T-6002 Transaction Monitoring Tracking all of victim's financial transactions through shared bank account access, transaction alert notifications, statement monitoring, or financial app access. Creates comprehensive surveillance of victim's spending, location (from merchant addresses), social activities, and any attempts to prepare for leaving. TFA-T-2006 Two-Factor Interception Intercepting two-factor authentication codes through SIM swapping, access to victim's authenticator app, interception of SMS codes, or control of backup codes. Defeats security measures designed to protect accounts, enabling unauthorized access even when victim has changed passwords. TFA-T-6004 Unauthorized Transactions Making purchases, transfers, or withdrawals from victim's financial accounts without consent. May drain savings, make extravagant purchases, transfer funds to perpetrator-controlled accounts, or take on debt in victim's name. Often escalates during separation when perpetrator seeks to deplete shared resources. TFA-T-7005 Vehicle Sabotage Remotely disabling, manipulating, or monitoring victim's connected vehicle. Modern connected cars may be remotely controlled through manufacturer apps, including locking/unlocking, starting/stopping engine, tracking location, and in some cases controlling speed or braking. May also include disabling vehicle through telematics systems. "
},
{
"id": 57,
"title": "Backup/Cloud Access, Technique TFA-T-2007",
"path": "/techniques/TFA-T-2007/index.html",
"content": " Backup/Cloud Access Accessing victim's personal data through cloud backup services such as iCloud, Google Drive, OneDrive, or device backups. Cloud backups often contain comprehensive copies of messages, photos, contacts, browsing history, and app data, providing extensive surveillance capability from a single access point. ID: TFA-T-2007 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 58,
"title": "Email/Communication Rerouting, Technique TFA-T-5010",
"path": "/techniques/TFA-T-5010/index.html",
"content": " Email/Communication Rerouting Setting up email forwarding rules, message redirects, or call forwarding to intercept victim's incoming communications without their knowledge. Allows perpetrator to monitor all communications and selectively prevent messages from reaching victim, particularly from support services or legal representatives. ID: TFA-T-5010 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 59,
"title": "Credit/Identity Theft, Technique TFA-T-6008",
"path": "/techniques/TFA-T-6008/index.html",
"content": " Credit/Identity Theft Opening financial accounts, taking on debt, applying for credit, or conducting financial transactions using victim's personal information and identity without consent. Damages victim's credit score, creates legal liability, and may take years to resolve. Often not discovered until victim is denied credit or contacted by collectors. ID: TFA-T-6008 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 60,
"title": "Financial Account Lockout, Technique TFA-T-6001",
"path": "/techniques/TFA-T-6001/index.html",
"content": " Financial Account Lockout Changing passwords, removing authorized users, or otherwise denying victim access to shared or individual financial accounts. Cuts victim off from their own money, savings, investments, or financial records, creating immediate economic vulnerability and dependence. ID: TFA-T-6001 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 61,
"title": "Crypto/Investment Fraud, Technique TFA-T-6006",
"path": "/techniques/TFA-T-6006/index.html",
"content": " Crypto/Investment Fraud Deceiving victim into fraudulent cryptocurrency investments, fake trading platforms, or other financial schemes. Often involves building trust, demonstrating fake returns, and gradually escalating investment amounts. May also involve coerced cryptocurrency transfers that are difficult to trace or recover. ID: TFA-T-6006 ⓘ Tactic: Resource & Financial Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 62,
"title": "Device Sabotage, Technique TFA-T-2009",
"path": "/techniques/TFA-T-2009/index.html",
"content": " Device Sabotage Deliberately damaging, corrupting, factory-resetting, or wiping victim's devices or data. May involve physical damage, remote wipe commands, malware installation, or deliberate corruption of important files. Destroys evidence, disrupts victim's ability to communicate, and causes emotional and financial harm. ID: TFA-T-2009 ⓘ Tactic: Account & Access Compromise Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 63,
"title": "Historical Content Weaponization, Technique TFA-T-4010",
"path": "/techniques/TFA-T-4010/index.html",
"content": " Historical Content Weaponization Surfacing old posts, photos, messages, or other historical digital content to harm victim in their current context. Includes finding embarrassing teenage posts, old dating profiles, past political statements, or previously private content that can be taken out of context to damage victim's current relationships, employment, or reputation. ID: TFA-T-4010 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 64,
"title": "Platform Abuse Reporting, Technique TFA-T-3007",
"path": "/techniques/TFA-T-3007/index.html",
"content": " Platform Abuse Reporting Weaponizing platform content moderation and reporting systems to get victim's accounts banned, restricted, or content removed. Perpetrator files false or exaggerated reports about victim's content, coordinating multiple reports to trigger automated enforcement. Silences victim and removes their online presence. ID: TFA-T-3007 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 65,
"title": "Stalking Coordination, Technique TFA-T-7008",
"path": "/techniques/TFA-T-7008/index.html",
"content": " Stalking Coordination Using technology to plan, coordinate, and execute physical stalking of victim. Includes using location data to track patterns, mapping victim's routine, coordinating with others to maintain surveillance, and using digital tools to avoid detection. Technology amplifies traditional stalking by providing real-time intelligence. ID: TFA-T-7008 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 66,
"title": "Location-Based Assault, Technique TFA-T-7001",
"path": "/techniques/TFA-T-7001/index.html",
"content": " Location-Based Assault Using GPS tracking, location sharing, or other surveillance techniques to determine victim's real-time location and then physically approaching or assaulting them. Technology enables perpetrator to find victim at any location, negating traditional safety measures like staying with friends or varying routines. ID: TFA-T-7001 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 67,
"title": "IoT Device Weaponization, Technique TFA-T-7006",
"path": "/techniques/TFA-T-7006/index.html",
"content": " IoT Device Weaponization Using smart home devices to create fear, disorientation, or physical discomfort. Includes randomly triggering alarms, playing sounds through speakers, turning lights on/off, changing temperature extremes, activating cameras, or other manipulations of the smart home environment designed to terrorize victim. ID: TFA-T-7006 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 68,
"title": "Impersonation Harassment, Technique TFA-T-3009",
"path": "/techniques/TFA-T-3009/index.html",
"content": " Impersonation Harassment Creating fake accounts impersonating victim to damage their reputation, relationships, or employment. Fake accounts may send messages to victim's contacts, post inappropriate content, engage in harmful activities, or create the appearance that victim is behaving erratically or antisocially. ID: TFA-T-3009 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 69,
"title": "Medical Device Interference, Technique TFA-T-7007",
"path": "/techniques/TFA-T-7007/index.html",
"content": " Medical Device Interference Tampering with victim's connected medical devices, health monitoring equipment, or health data. May include altering medication reminder settings, manipulating health data to affect treatment decisions, disabling monitoring devices, or interfering with telehealth appointments. Creates direct physical health risks. ID: TFA-T-7007 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 70,
"title": "Public Humiliation Posts, Technique TFA-T-3008",
"path": "/techniques/TFA-T-3008/index.html",
"content": " Public Humiliation Posts Posting embarrassing, mocking, degrading, or humiliating content about victim on public platforms. Content may include unflattering images, private information, personal struggles, or fabricated scenarios designed to damage victim's social standing and cause emotional harm. ID: TFA-T-3008 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 71,
"title": "Swatting, Technique TFA-T-3006",
"path": "/techniques/TFA-T-3006/index.html",
"content": " Swatting Making false emergency reports (bomb threats, hostage situations, active shooter calls) to provoke armed law enforcement response at victim's location. Swatting creates immediate physical danger to victim and household, causes severe psychological trauma, and may result in injury or death from police response. ID: TFA-T-3006 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 72,
"title": "Fake Evidence Creation, Technique TFA-T-4011",
"path": "/techniques/TFA-T-4011/index.html",
"content": " Fake Evidence Creation Fabricating digital evidence including fake emails, text messages, documents, receipts, screenshots, or records to frame victim for misconduct, support false legal claims, or manipulate decision-makers. May involve sophisticated forgeries using editing tools or simple fabrication of documents. ID: TFA-T-4011 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 73,
"title": "Emergency Service Manipulation, Technique TFA-T-7009",
"path": "/techniques/TFA-T-7009/index.html",
"content": " Emergency Service Manipulation Filing false police reports, fabricating evidence for protective orders, making false welfare check requests, or otherwise weaponizing emergency and legal services against victim. Uses digital tools to create false evidence, coordinate false reports, or manipulate authorities into taking action against victim. ID: TFA-T-7009 ⓘ Tactic: Physical Enablement Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 74,
"title": "Direct Threat Messaging, Technique TFA-T-3001",
"path": "/techniques/TFA-T-3001/index.html",
"content": " Direct Threat Messaging Sending threatening messages to victim via any digital platform, including text messages, emails, direct messages, voice messages, or comments. Threats may be explicit (threatening violence, harm, or consequences) or implicit (veiled references to harm, ominous statements, or threatening imagery). ID: TFA-T-3001 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 75,
"title": "False Narrative Campaigns, Technique TFA-T-4005",
"path": "/techniques/TFA-T-4005/index.html",
"content": " False Narrative Campaigns Systematically spreading false information about victim to their social network, workplace, community, or online audiences. False narratives may portray victim as unstable, abusive, dishonest, or dangerous, serving to isolate victim from support, preemptively discredit their accounts of abuse, and build sympathy for perpetrator. ID: TFA-T-4005 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 76,
"title": "Proxy Harassment via AI, Technique TFA-T-3012",
"path": "/techniques/TFA-T-3012/index.html",
"content": " Proxy Harassment via AI Using AI tools including large language models, voice cloning, or text generation to create and distribute harassing content at scale. AI enables perpetrators to generate personalized, varied harassment content more quickly and in greater volume than manual methods, and may disguise the perpetrator's authorship. ID: TFA-T-3012 ⓘ Tactic: Harassment & Intimidation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 77,
"title": "Digital Gaslighting, Technique TFA-T-4002",
"path": "/techniques/TFA-T-4002/index.html",
"content": " Digital Gaslighting Manipulating digital records, device settings, files, or other digital artifacts to make victim doubt their own memory, perception, or sanity. Includes moving or deleting files, editing shared documents, changing device settings, manipulating photo timestamps, or altering digital records the victim relies on. ID: TFA-T-4002 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 78,
"title": "Non-Consensual Intimate Image Distribution, Technique TFA-T-4003",
"path": "/techniques/TFA-T-4003/index.html",
"content": " Non-Consensual Intimate Image Distribution Sharing or threatening to share intimate, sexual, or nude images of victim without their consent. Commonly known as 'revenge porn,' this technique weaponizes intimate content to humiliate, control, or coerce victim. Includes sharing via private messages, posting publicly, uploading to pornographic websites, or sending to victim's contacts, family, or employer. ID: TFA-T-4003 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 79,
"title": "Deepfake Creation, Technique TFA-T-4004",
"path": "/techniques/TFA-T-4004/index.html",
"content": " Deepfake Creation Creating synthetic intimate, compromising, or damaging media of victim using AI-powered deepfake technology. Generated content may be indistinguishable from real imagery and can be used for extortion, reputational harm, or psychological abuse. Includes face-swapping onto pornographic content, synthetic voice generation, or fabricated video. ID: TFA-T-4004 ⓘ Tactic: Information Manipulation Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 80,
"title": "Social Media Control, Technique TFA-T-5003",
"path": "/techniques/TFA-T-5003/index.html",
"content": " Social Media Control Controlling who victim can follow, friend, interact with, or be visible to on social media platforms. May involve demanding victim unfriend specific contacts, monitoring follower/following lists, requiring approval before posting, or demanding social media passwords to vet all interactions. ID: TFA-T-5003 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 81,
"title": "Device Time/Access Restrictions, Technique TFA-T-5004",
"path": "/techniques/TFA-T-5004/index.html",
"content": " Device Time/Access Restrictions Using parental controls, screen time management, MDM features, or physical control to restrict when and how victim can use their own devices. Limits victim's ability to communicate, access information, seek help, or maintain independence. ID: TFA-T-5004 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 82,
"title": "Physical Tracker Planting, Technique TFA-T-1002",
"path": "/techniques/TFA-T-1002/index.html",
"content": " Physical Tracker Planting Placing GPS tracking devices such as AirTags, Tile trackers, or vehicle GPS units in victim's belongings, vehicle, or on their person without consent. These commercially available devices are inexpensive, small, and designed for long battery life, making covert placement easy. Perpetrators use them to monitor victim's movements, identify frequented locations, and anticipate travel patterns. ID: TFA-T-1002 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 83,
"title": "Communication Interception, Technique TFA-T-1005",
"path": "/techniques/TFA-T-1005/index.html",
"content": " Communication Interception Accessing victim's emails, text messages, voicemails, and other communications through compromised accounts, email forwarding rules, message mirroring, or linked devices. Perpetrator reads, copies, or monitors communications without victim's knowledge, gaining intelligence about victim's plans, support network, and emotional state. ID: TFA-T-1005 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 84,
"title": "Social Media Monitoring, Technique TFA-T-1004",
"path": "/techniques/TFA-T-1004/index.html",
"content": " Social Media Monitoring Systematic observation of victim's public and semi-public social media activity, connections, check-ins, likes, comments, and tagged posts. May include creating fake accounts to follow private profiles, monitoring friends' posts for references to victim, or using social media analytics tools to track patterns of activity and connections. ID: TFA-T-1004 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 85,
"title": "Shared Account Surveillance, Technique TFA-T-1003",
"path": "/techniques/TFA-T-1003/index.html",
"content": " Shared Account Surveillance Exploiting legitimately shared accounts or location sharing services (Find My Friends, Google location sharing, family phone plans) to monitor victim beyond the scope of original consent. Often occurs in relationships where sharing was mutual but continues after separation, or where the perpetrator coerces ongoing access under the guise of reasonable family coordination. ID: TFA-T-1003 ⓘ Tactic: Surveillance & Tracking Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 86,
"title": "Network Poisoning, Technique TFA-T-5005",
"path": "/techniques/TFA-T-5005/index.html",
"content": " Network Poisoning Contacting victim's support network (friends, family, colleagues, therapist, legal counsel) to spread lies, create conflict, or undermine trust. Perpetrator strategically reaches out to key support people to isolate victim from help sources, often preemptively positioning themselves as the reasonable party. ID: TFA-T-5005 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
},
{
"id": 87,
"title": "Contact Blocking/Filtering, Technique TFA-T-5002",
"path": "/techniques/TFA-T-5002/index.html",
"content": " Contact Blocking/Filtering Blocking victim's contacts or filtering their incoming communications without victim's knowledge or consent. Perpetrator may block specific people on victim's phone, set up email filters to auto-delete messages from support contacts, or manipulate device settings to prevent certain calls or messages from reaching victim. ID: TFA-T-5002 ⓘ Tactic: Isolation & Control Created: 04 February 2026 Last Modified: 04 February 2026 Mitigations This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. "
}
]